package by.peleng.java.lesson1;
/*6. Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера.
 */
public class Cycles6 {
    public static void main(String[] args) {

        for (int i = 0; i <=128; i++) {
            System.out.println(i + ": " + (char)i);
        }




    }


}
