package by.peleng.jav.Lesson2_02;
/*2 Создать объект класса Автомобиль, используя классы Колесо, Двигатель. Методы: ехать, заправляться,
менять колесо, вывести на консоль марку автомобиля.*/
public class Engine {

    public void start() {
        System.out.println("Двигатель завелся");
    }
    public void stop() {
        System.out.println("Двигатель остановился");
    }

    public Engine() {
    }
}
